src/Catalogs/Оповещения/Оповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оповещения</name>
  <attributes>
    <name>ВключитьПоказателиВТекстОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИнтервалМеждуОповещениями</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОЗакрытии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееЗадание</name>
    <type>
      <types>CatalogRef.ОчередьЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбораДляИнцидентов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныеШаблоныОЗакрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтноситсяКТипуИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияСмс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияСмсЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаОповещенияЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПоказателей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодГруппировкиОповещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПовторногоОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоПочте</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоСМС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРеакции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОповещатьНеактуальный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещатьЗакрыт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьУдалять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоСкайпу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ЖурналОповещений/ЖурналОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОповещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОповещениеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВключитьПоказателиВТекстОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Оповещение</name>
    <type>
      <types>CatalogRef.Оповещения</types>
      <types>CatalogRef.ОповещенияОперативные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Оповещения/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьСписокПоказателей" Тогда
		ЭтотОбъект.ОбновитьОтображениеДанных();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьВыбранное(Команда)
	ВыбранныеОповещения = ЭтотОбъект.Элементы.Список.ВыделенныеСтроки; 
	ЗапуститьВыбранноеНаСервере(ВыбранныеОповещения);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Выбранные оповещения запущены'"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.Оповещения"));
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВсе(Команда)
	
	ЗапуститьВсеНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Оповещения запущены'"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.Оповещения"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьВыбранное(Команда)
	ВыбранныеОповещения = ЭтотОбъект.Элементы.Список.ВыделенныеСтроки;
	ОстановитьВыбранноеНаСервере(ВыбранныеОповещения);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Выбранные оповещения остановлены'"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.Оповещения"));
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьВсе(Команда)
	
	ОстановитьВсеНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Оповещения остановлены'"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.Оповещения"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЖурнал(Команда)
	ОчиститьЖурналНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.Оповещения"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияВыбранным(Команда)
    
    ДанныеДляРедактирования = Новый Массив;
    
    Для Каждого ТекСтрока Из ЭтотОбъект.Элементы.Список.ВыделенныеСтроки Цикл
        
        ДанныеДляРедактирования.Добавить(ТекСтрока);
        
    КонецЦикла;
     
    ПараметрыОткрытия = Новый Структура("Оповещения", ДанныеДляРедактирования);
    
    ТекДанные = ЭтотОбъект.Элементы.Список.ТекущиеДанные;
    ПараметрыОткрытия.Вставить("ПериодГруппировкиОповещений", ТекДанные.ПериодГруппировкиОповещений);
    ПараметрыОткрытия.Вставить("ПериодПовторногоОповещения", ТекДанные.ПериодПовторногоОповещения);
    ПараметрыОткрытия.Вставить("ИнтервалОЗакрытии", ТекДанные.ИнтервалОЗакрытии);
    
    ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьЗначенияВыбраннымЗакрытие", ЭтотОбъект);
    ОткрытьФорму("Справочник.Оповещения.Форма.ФормаУстановитьЗначенияВыбранным", ПараметрыОткрытия,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
    ОткрытьФорму("ОбщаяФорма.ФормаКонстантОповещения");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура("ОбъектКопирования", Элемент.ТекущаяСтрока);
	ОткрытьФорму("Справочник.Оповещения.Форма.ФормаЭлемента", ПараметрыОткрытия,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗапуститьВсеНаСервере()
	
	
	МаксимальноеКоличествоИсполняющихФоновыхЗаданий = Константы.МаксимальноеКоличествоИсполняющихФоновыхЗаданий.Получить();
	Если МаксимальноеКоличествоИсполняющихФоновыхЗаданий = 0 Тогда
		Константы.МаксимальноеКоличествоИсполняющихФоновыхЗаданий.Установить(1);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оповещения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Оповещения КАК Оповещения
		|ГДЕ
		|	Оповещения.ИсполняющееЗадание <> ЗНАЧЕНИЕ(Справочник.ОчередьЗаданий.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОповещениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ОповещениеОбъект <> Неопределено И ОповещениеОбъект.ПроверитьКорректностьЗаполнения(Ложь) Тогда
			ОчередьЗаданий.ИзменитьЗадание(ОповещениеОбъект.ИсполняющееЗадание, Новый Структура("Использование", Истина));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОстановитьВсеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оповещения.ИсполняющееЗадание
		|ИЗ
		|	Справочник.Оповещения КАК Оповещения
		|ГДЕ
		|	Оповещения.ИсполняющееЗадание <> ЗНАЧЕНИЕ(Справочник.ОчередьЗаданий.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОчередьЗаданий.ИзменитьЗадание(Выборка.ИсполняющееЗадание, Новый Структура("Использование", Ложь));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЖурналНаСервере()
	
	Для Каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		
		Набор = РегистрыСведений.ЖурналОповещений.СоздатьНаборЗаписей();
		Набор.Отбор.Оповещение.Установить(Строка);
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапуститьВыбранноеНаСервере(Оповещения)
	Для Каждого ТекОповещение Из Оповещения Цикл
		ОповещениеОбъект = ТекОповещение.ПолучитьОбъект();
		
		Если ОповещениеОбъект <> Неопределено И ОповещениеОбъект.ПроверитьКорректностьЗаполнения(Истина) Тогда
			Если ОповещениеОбъект.ИсполняющееЗадание <> Справочники.ОчередьЗаданий.ПустаяСсылка() Тогда
				ОчередьЗаданий.ИзменитьЗадание(ОповещениеОбъект.ИсполняющееЗадание, Новый Структура("Использование", Истина));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОстановитьВыбранноеНаСервере(Оповещения)
	Для Каждого ТекОповещение Из Оповещения Цикл
		ОповещениеОбъект = ТекОповещение.ПолучитьОбъект();
		
		Если ОповещениеОбъект <> Неопределено И ОповещениеОбъект.ПроверитьКорректностьЗаполнения(Ложь) Тогда
			Если ОповещениеОбъект.ИсполняющееЗадание <> Справочники.ОчередьЗаданий.ПустаяСсылка() Тогда
				ОчередьЗаданий.ИзменитьЗадание(ОповещениеОбъект.ИсполняющееЗадание, Новый Структура("Использование", Ложь));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияВыбраннымЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
    
    Если РезультатЗакрытия = "Обновить" Тогда
        ЭтотОбъект.Элементы.Список.Обновить();
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти
